tutorials/channelFoam/channel395/0.org/nuSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomWall      
    {
        type            zeroGradient;
    }

    topWall         
    {
        type            zeroGradient;
    }

    sides1          
    {
        type            cyclic;
    }

    sides2          
    {
        type            cyclic;
    }

    inout1          
    {
        type            cyclic;
    }

    inout2          
    {
        type            cyclic;
    }
}

// ************************************************************************* //
